### Plan: 2 to add, 0 to change, 2 to destroy.
```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

# module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
    ~ id             = "rtbassoc-060eaba917fbf14eb" -> (known after apply)
      route_table_id = "rtb-0b789037e1f548a5d"
    ~ subnet_id      = "subnet-0a02246c6831fbf91" -> (known after apply) # forces replacement
  }

# module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
    ~ arn                             = "arn:aws:ec2:eu-west-1:090412029008:subnet/subnet-0a02246c6831fbf91" -> (known after apply)
      assign_ipv6_address_on_creation = false
      availability_zone               = "eu-west-1b"
    ~ availability_zone_id            = "euw1-az2" -> (known after apply)
    ~ cidr_block                      = "10.2.2.0/24" -> "10.2.3.0/24" # forces replacement
    ~ id                              = "subnet-0a02246c6831fbf91" -> (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
      map_public_ip_on_launch         = true
    ~ owner_id                        = "090412029008" -> (known after apply)
      tags                            = {
          "Environment" = "stg"
          "Name"        = "tfmultienv-stg-public-eu-west-1b"
          "Terraform"   = "true"
      }
      vpc_id                          = "vpc-0c7676ac9e1909e7c"
  }

Plan: 2 to add, 0 to change, 2 to destroy.

```
